Revit 2027 API
ParameterTypeId.FabricationProductDataProduct Property
 "Product Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataProduct { get; }
Public Shared ReadOnly Property FabricationProductDataProduct As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataProduct {
	ForgeTypeId^ get ();
}
static member FabricationProductDataProduct : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace